In [5]:
import pandas as pd

In [6]:
df = pd.read_csv('sales_data.csv')
#fetch the first 5 column
df.head(5)

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [7]:
df.describe()

       Transaction ID         Age     Quantity  Price per Unit  Total Amount
count     1000.000000  1000.00000  1000.000000     1000.000000   1000.000000
mean       500.500000    41.39200     2.514000      179.890000    456.000000
std        288.819436    13.68143     1.132734      189.681356    559.997632
min          1.000000    18.00000     1.000000       25.000000     25.000000
25%        250.750000    29.00000     1.000000       30.000000     60.000000
50%        500.500000    42.00000     3.000000       50.000000    135.000000
75%        750.250000    53.00000     4.000000      300.000000    900.000000
max       1000.000000    64.00000     4.000000      500.000000   2000.000000

In [8]:
df.isnull().sum()

Transaction ID      0
Date                0
Customer ID         0
Gender              0
Age                 0
Product Category    0
Quantity            0
Price per Unit      0
Total Amount        0
dtype: int64

In [9]:
df.dtypes

Transaction ID       int64
Date                object
Customer ID         object
Gender              object
Age                  int64
Product Category    object
Quantity             int64
Price per Unit       int64
Total Amount         int64
dtype: object

In [10]:
# Renaming Columns
df= df.rename(columns={'Order Date':'Sales Date'})
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [2]:
import pandas as pd
df=pd.read_csv('sales_data.csv')

In [3]:
df

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100
...,...,...,...,...,...,...,...,...,...
995,996,2023-05-16,CUST996,Male,62,Clothing,1,50,50
996,997,2023-11-17,CUST997,Male,52,Beauty,3,30,90
997,998,2023-10-29,CUST998,Female,23,Beauty,4,25,100
998,999,2023-12-05,CUST999,Female,36,Electronics,3,50,150
999,1000,2023-04-12,CUST1000,Male,47,Electronics,4,30,120

In [4]:
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100

In [5]:
df['Country']='India'
df

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Country
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,India
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,India
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,India
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,India
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,India
...,...,...,...,...,...,...,...,...,...,...
995,996,2023-05-16,CUST996,Male,62,Clothing,1,50,50,India
996,997,2023-11-17,CUST997,Male,52,Beauty,3,30,90,India
997,998,2023-10-29,CUST998,Female,23,Beauty,4,25,100,India
998,999,2023-12-05,CUST999,Female,36,Electronics,3,50,150,India
999,1000,2023-04-12,CUST1000,Male,47,Electronics,4,30,120,India

In [6]:
df.head()

,Transaction ID,Date,Customer ID,Gender,Age,Product Category,Quantity,Price per Unit,Total Amount,Country
0,1,2023-11-24,CUST001,Male,34,Beauty,3,50,150,India
1,2,2023-02-27,CUST002,Female,26,Clothing,2,500,1000,India
2,3,2023-01-13,CUST003,Male,50,Electronics,1,30,30,India
3,4,2023-05-21,CUST004,Male,37,Clothing,1,500,500,India
4,5,2023-05-06,CUST005,Male,30,Beauty,2,50,100,India

In [7]:
df.dtypes

Transaction ID       int64
Date                object
Customer ID         object
Gender              object
Age                  int64
Product Category    object
Quantity             int64
Price per Unit       int64
Total Amount         int64
Country             object
dtype: object

In [12]:
#Merging and joining dataframes
#Create Sample Dataframe
df1= pd.DataFrame({'Key' :['A','B','C'], 'Value1':[1,2,3]})
df2 =pd.DataFrame({'Key' :['A','B','D'], 'Value2':[4,5,6]})

In [21]:
df1

  Key  Value1
0   A       1
1   B       2
2   C       3

In [22]:
df2

  Key  Value2
0   A       4
1   B       5
2   D       6

In [23]:
#Merging Dataframe on the "Key Column"
pd.merge(df1,df2,on="Key" ,how="inner")

  Key  Value1  Value2
0   A       1       4
1   B       2       5

In [24]:
pd.merge(df1,df2,on="Key" ,how="outer")

  Key  Value1  Value2
0   A     1.0     4.0
1   B     2.0     5.0
2   C     3.0     NaN
3   D     NaN     6.0

In [26]:
pd.merge(df1,df2,on="Key" ,how="left")

  Key  Value1  Value2
0   A       1     4.0
1   B       2     5.0
2   C       3     NaN

In [27]:
pd.merge(df1,df2,on="Key" ,how="right")

  Key  Value1  Value2
0   A     1.0       4
1   B     2.0       5
2   D     NaN       6